tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "asdf"
brew "autoconf"
brew "automake"
brew "pycparser"
brew "cffi"
brew "openssl@3"
brew "cryptography"
brew "awscli"
brew "bash"
brew "berkeley-db", link: true
brew "boost"
brew "glib"
brew "coreutils"
brew "libssh2"
brew "curl"
brew "dnsmasq"
brew "docker", link: false
brew "doctl"
brew "docutils"
brew "dog"
brew "folly"
brew "fizz"
brew "gnutls"
brew "harfbuzz"
brew "icu4c@76"
brew "openjpeg"
brew "libass"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "grep"
brew "htop"
brew "jq"
brew "llvm"
brew "mas"
brew "nmap"
brew "node"
brew "openapi-generator"
brew "openjdk@11"
brew "openssl@1.1"
brew "openvino"
brew "ossp-uuid"
brew "pandoc"
brew "pdfcrack"
brew "perl"
brew "pipenv"
brew "pipx"
brew "pure"
brew "qpdf"
brew "redis"
brew "rust"
brew "switchaudio-osx"
brew "telnet"
brew "vim"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "xcbeautify"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "beyond-compare"
cask "cleanshot"
cask "db-browser-for-sqlite"
cask "docker"
cask "font-meslo-lg"
cask "git-credential-manager"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "mks"
cask "monodraw"
cask "ngrok"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "xcodes"
cask "zoom"
mas "Dato", id: 1470584107
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Tag Editor Lite", id: 984278082
mas "TestFlight", id: 899247664
mas "WhatsApp (old)", id: 1147396723
mas "Xcode", id: 497799835
vscode "aliariff.vscode-erb-beautify"
vscode "bradymholt.pgformatter"
vscode "craigmaslowski.erb"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "embertooling.vscode-ember"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "sysoev.language-stylus"
vscode "testdouble.vscode-standard-ruby"
vscode "thisismanta.stylus-supremacy"
vscode "typed-ember.glint-vscode"
vscode "vscjava.vscode-gradle"
