tap "amplitude/ampli"
tap "crunchydata/brew"
tap "dbt-labs/dbt"
tap "domt4/autoupdate", trusted: { commands: ["autoupdate"] }
tap "heroku/brew"
tap "snowflakedb/snowflake-cli"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Extremely Fast Compression algorithm
brew "lz4"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# High performance key/value database
brew "berkeley-db", link: true
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line tool for DigitalOcean
brew "doctl"
# Text processing system for reStructuredText
brew "docutils"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Suite CLI
brew "gogcli"
# GNU grep, egrep and fgrep
brew "grep"
# OpenType text shaping engine
brew "harfbuzz"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Port scanning utility for large networks
brew "nmap"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk@11"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Package Management Solution for Python
brew "rye"
# CLI for snowflake
brew "snowflake-cli"
# Secure Reliable Transport
brew "srt"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Image processing library
brew "vips"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Compare files and folders
cask "beyond-compare"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
cask "font-meslo-lg"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
# Tool to create text-based art
cask "monodraw"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Menu bar manager
cask "thaw"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Video communication and virtual meeting platform
cask "zoom"
mas "Dato", id: 1470584107
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pages", id: 361309726
mas "Pixelmator Pro", id: 1289583905
mas "Tag Editor 2", id: 984278082
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "aliariff.vscode-erb-beautify"
vscode "anthropic.claude-code"
vscode "bradymholt.pgformatter"
vscode "cmacu.gotoanything"
vscode "craigmaslowski.erb"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "embertooling.vscode-ember"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.codespaces"
vscode "github.vscode-github-actions"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "koichisasada.vscode-rdbg"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-chat-customizations-evaluations"
vscode "ms-vscode.vscode-speech"
vscode "openai.chatgpt"
vscode "rubocop.vscode-rubocop"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "sysoev.language-stylus"
vscode "testdouble.vscode-standard-ruby"
vscode "thisismanta.stylus-supremacy"
vscode "typed-ember.glint-vscode"
cargo "claude-mergetool"
npm "@dbml/cli"
npm "@google/gemini-cli"
npm "@scalar/cli"
npm "corepack"
npm "socket"
