tap "crunchydata/brew"
tap "dbt-labs/dbt"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "microsoft/git"
tap "porter-dev/porter"
tap "rainforestapp/public"
tap "render-oss/render"
tap "ringohub/redis-cli"
brew "age"
brew "lz4"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "openssl@3"
brew "asdf"
brew "python@3.11"
brew "awscli"
brew "bash"
brew "berkeley-db", link: true
brew "icu4c@76"
brew "boost"
brew "glib"
brew "cairo"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "libssh2"
brew "curl"
brew "deno"
brew "diff-so-fancy"
brew "dnsmasq"
brew "docker", link: false
brew "docutils"
brew "dog"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "python@3.12"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "libksba"
brew "gnupg"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "grep"
brew "guile"
brew "htop"
brew "jq"
brew "krb5"
brew "openssl@1.1"
brew "libp11"
brew "libpq"
brew "llvm"
brew "mas"
brew "mitmproxy"
brew "mvfst"
brew "nmap"
brew "node"
brew "openjdk@11"
brew "openapi-generator"
brew "openvino"
brew "ossp-uuid"
brew "pandoc"
brew "pdfcrack"
brew "perl"
brew "pipenv"
brew "proxychains-ng"
brew "pure"
brew "python@3.10"
brew "python@3.9"
brew "qpdf"
brew "redis"
brew "rust"
brew "sevenzip"
brew "stunnel"
brew "stuntman"
brew "swagger-codegen"
brew "switchaudio-osx"
brew "telnet"
brew "vim"
brew "virtualenv"
brew "watch"
brew "watchman"
brew "wget"
brew "xcbeautify"
brew "yq"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "crunchydata/brew/cb"
brew "heroku/brew/heroku"
brew "jakehilborn/jakehilborn/displayplacer"
brew "rainforestapp/public/rainforest-cli"
brew "render-oss/render/render"
brew "ringohub/redis-cli/redis-cli", link: false
cask "1password"
cask "1password-cli"
cask "beyond-compare"
cask "cleanshot"
cask "db-browser-for-sqlite"
cask "docker"
cask "font-meslo-lg"
cask "git-credential-manager"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "keycastr"
cask "mks"
cask "monodraw"
cask "ngrok"
cask "pgadmin4"
cask "rectangle"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "xcodes"
cask "zoom"
mas "Dato", id: 1470584107
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Tag Editor Lite", id: 984278082
mas "WhatsApp (old)", id: 1147396723
mas "Xcode", id: 497799835
vscode "aliariff.vscode-erb-beautify"
vscode "bradymholt.pgformatter"
vscode "craigmaslowski.erb"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "lifeart.vscode-ember-unstable"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.language-stylus"
vscode "testdouble.vscode-standard-ruby"
vscode "thisismanta.stylus-supremacy"
vscode "typed-ember.glint-vscode"
vscode "vscjava.vscode-gradle"
